<template>
  <b-modal
    :active="isOpen"
    has-modal-card
    trap-focus
    aria-role="dialog"
    aria-modal
    :on-cancel="close"
  >
    <div class="modal-card">
      <header class="modal-card-head">
        <p class="modal-card-title has-text-left">プライバシーポリシー</p>
      </header>
      <section class="modal-card-body">
        <div class="is-size-7 has-text-left content">
          <p>作成中</p>
          <!-- <p>
      ワードウルフオンライン（以下，「当サイト」といいます。）は，本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）におけるプライバシー情報の取扱いについて，以下のとおりプライバシーポリシー（以下，「本ポリシー」といいます。）を定めます。
    </p>
    <h3 class="is-size-6">第1条（プライバシー情報）</h3>
    <p>
      プライバシー情報のうち「個人情報」とは，個人情報保護法にいう「個人情報」を指すものとし，生存する個人に関する情報であって，当該情報に含まれる氏名，生年月日，住所，電話番号，連絡先その他の記述等により特定の個人を識別できる情報を指します。
      <br />プライバシー情報のうち「履歴情報および特性情報」とは，上記に定める「個人情報」以外のものをいい，ご利用いただいたサービスやご購入いただいた商品，ご覧になったページや広告の履歴，ユーザーが検索された検索キーワード，ご利用日時，ご利用の方法，ご利用環境，郵便番号や性別，職業，年齢，ユーザーのIPアドレス，クッキー情報，位置情報，端末の個体識別情報などを指します。
    </p>
    <h3 class="is-size-6">第２条（プライバシー情報の収集方法）</h3>
    <p>
      当サイトは，ユーザーが利用登録をする際にメールアドレスなどの個人情報をお尋ねすることがあります。
      <br />当サイトは，ユーザーについて，利用したサービスやソフトウエア，購入した商品，閲覧したページや広告の履歴，検索した検索キーワード，利用日時，利用方法，利用環境（携帯端末を通じてご利用の場合の当該端末の通信状態，利用に際しての各種設定情報なども含みます），IPアドレス，クッキー情報，位置情報，端末の個体識別情報などの履歴情報および特性情報を，ユーザーが当サイトや提携先のサービスを利用しまたはページを閲覧する際に収集します。
    </p>
    <h3 class="is-size-6">第３条（個人情報を収集・利用する目的）</h3>
    <p>当サイトが個人情報を収集・利用する目的は，以下のとおりです。</p>
    <ol>
      <li>
        ユーザーに自分の登録情報の閲覧や修正，利用状況の閲覧を行っていただくために，連絡先などの登録情報，利用されたサービスなどに関する情報を表示する目的
      </li>
      <li>
        ユーザーの本人確認を行うために，メールアドレスなどの情報を利用する目的
      </li>
      <li>
        ユーザーからのお問い合わせに対応するために，お問い合わせ内容など当サイトがユーザーに対してサービスを提供するにあたって必要となる情報や，ユーザーのサービス利用状況，連絡先情報などを利用する目的
      </li>
      <li>上記の利用目的に付随する目的</li>
    </ol>
    <h3 class="is-size-6">第４条（個人情報の第三者提供）</h3>
    <p>
      当サイトは，次に掲げる場合を除いて，あらかじめユーザーの同意を得ることなく，第三者に個人情報を提供することはありません。ただし，個人情報保護法その他の法令で認められる場合を除きます。
    </p>
    <ol>
      <li>法令に基づく場合</li>
      <li>
        人の生命，身体または財産の保護のために必要がある場合であって，本人の同意を得ることが困難であるとき
      </li>
      <li>
        公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって，本人の同意を得ることが困難であるとき
      </li>
      <li>
        国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって，本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき
      </li>
      <li>
        予め次の事項を告知あるいは公表をしている場合
        <ul>
          <li>利用目的に第三者への提供を含むこと</li>
          <li>第三者に提供されるデータの項目</li>
          <li>第三者への提供の手段または方法</li>
          <li>本人の求めに応じて個人情報の第三者への提供を停止すること</li>
        </ul>
      </li>
    </ol>
    <h3 class="is-size-6">第５条（個人情報の訂正および削除）</h3>
    <p>
      ユーザーは，当サイトの保有する自己の個人情報が誤った情報である場合には，当サイトが定める手続きにより，当サイトに対して個人情報の訂正または削除を請求することができます。
      <br />当サイトは，ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には，遅滞なく，当該個人情報の訂正または削除を行い，これをユーザーに通知します。
    </p>
    <h3 class="is-size-6">第６条（個人情報の利用停止等）</h3>
    <p>
      当サイトは，本人から，個人情報が，利用目的の範囲を超えて取り扱われているという理由，または不正の手段により取得されたものであるという理由により，その利用の停止または消去（以下，「利用停止等」といいます。）を求められた場合には，遅滞なく必要な調査を行い，その結果に基づき，個人情報の利用停止等を行い，その旨本人に通知します。ただし，個人情報の利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって，本人の権利利益を保護するために必要なこれに代わるべき措置をとれる場合は，この代替策を講じます。
    </p>
    <h3 class="is-size-6">第７条（プライバシーポリシーの変更）</h3>
    <p>
      本ポリシーの内容は，ユーザーに通知することなく，変更することができるものとします。
      <br />当サイトが別途定める場合を除いて，変更後のプライバシーポリシーは，本ウェブサイトに掲載したときから効力を生じるものとします。
    </p>
    <h3 class="is-size-6">第８条（お問い合わせ窓口）</h3>
    <p>
      本ポリシーに関するお問い合わせは，Twitter@ort_devまでお願いいたします。
    </p>
    <p class="is-pulled-right">以上</p> -->
        </div>
      </section>
    </div>
  </b-modal>
</template>

<script lang="ts">
import { Component, Vue, Prop } from 'nuxt-property-decorator'

@Component({
  components: {}
})
export default class PolicyModal extends Vue {
  @Prop({ type: Boolean })
  private isOpen!: boolean

  private close(): void {
    this.$emit('close-modal')
  }
}
</script>

<style></style>
