<template>
  <section class="section">
    <div class="container">
      <h1 class="title is-5">更新情報</h1>
      <div class="content">
        <ul class="has-text-left is-size-7">
          <li>2022/05/03 時短で日付更新した場合突然死しないよう変更</li>
          <li>2022/05/03 時短で日付更新した場合、更新直後から沈黙時間分のみが発言できない時間となるよう仕様変更</li>
          <li>2021/12/12 「最新」発言表示機能を追加（ページ分割時のみ）</li>
          <li>2021/12/12 3村に1村役職希望無効に変更</li>
          <li>2021/11/10 8人編成を14D猫編成に変更</li>
          <li>2021/11/10 死亡しても役職メッセージを参照できるよう変更</li>
          <li>2021/11/10 役職：聖痕者を追加</li>
          <li>2021/11/10 役職：猫又を追加</li>
          <li>2021/11/10 役職：背徳者を追加</li>
          <li>2021/11/10 役職：狂信者を追加</li>
          <li>2021/11/08 コミット機能を追加</li>
          <li>2021/04/30 ブラックリスト機能を追加</li>
          <li>2021/02/20 内部処理改善</li>
          <li>2021/02/15 発言抽出を別窓で開くよう変更</li>
          <li>2021/02/07 ダークテーマを追加</li>
          <li>2021/01/06 メモ機能を追加</li>
          <li>2020/12/08 国主呼び出し機能を追加</li>
          <li>2020/12/08 Twitterシェアボタンを追加</li>
          <li>2020/12/08 姉妹サイトへのリンクを追加</li>
          <li>2020/12/08 Amazonアソシエイトへのリンクを追加</li>
          <li>
            2020/09/18
            更新ボタンで発言抽出を解除しないよう変更（右上のボタンで解除）
          </li>
          <li>2020/09/18 ユーザ設定：キャラ画像を大きく表示を追加</li>
          <li>2020/09/18 ユーザ設定：文字を大きく表示を追加</li>
          <li>2020/09/15 村設定：初心者村を追加</li>
          <li>
            2020/09/14
            開始2時間前以降は24時間発言がなくても自動で村を去らないよう変更
          </li>
          <li>
            2020/08/11
            発言時にサーバーエラーが起きた際発言内容が消失する不具合を修正
          </li>
          <li>2020/08/11 囁きのアンカーコピーはキャラ略称をつけないよう変更</li>
          <li>2020/08/11 発言誤爆防止機能を追加</li>
          <li>2020/08/11 カミングアウト機能を追加</li>
          <li>
            2020/07/31
            参加者が集まらないまま開始日時を迎え、かつ次の村が建っていない場合、プロローグを延長するよう変更
          </li>
          <li>2020/07/12 村設定：ダミー役欠けを追加</li>
          <li>2020/07/11 参加者一覧から個別抽出できるよう変更</li>
          <li>2020/07/11 発言抽出のシステムメッセージを公開と非公開に分離</li>
          <li>2020/07/11 下部メニューのタブや大きさを記憶するよう変更</li>
          <li>2020/07/11 アンカーコピーにキャラ略称を追加</li>
          <li>2020/07/11 突然死した場合陣営勝利しても敗北扱いとするよう変更</li>
          <li>2020/06/08 役職：妖狐を追加</li>
          <li>2020/06/03 役職：共有者を追加</li>
          <li>2020/06/02 役職：C国狂人を追加</li>
          <li>2020/06/02 本番サーバ公開</li>
          <li>2020/02/10 テストサーバ公開</li>
        </ul>
      </div>
    </div>
  </section>
</template>

<script lang="ts">
import { Component, Vue } from 'nuxt-property-decorator'
// component
// type

@Component({
  components: {}
})
export default class extends Vue {
  /** head */
  private head() {
    return { title: ' | 更新情報' }
  }
}
</script>
